<template>
  <v-container v-resize="onResize">
    <v-row class="mx-6 my-8 text-center" justify="center">
      <div :class="(isSmallScreen ? 'text-h5' : 'text-h4') + ' font-weight-medium'" style="color: #2e74b5">
        Правила и условия пользования сервисом «Карта жизни»
      </div>
    </v-row>
    <v-row class="mx-6 my-8 pb-12 text-justify" justify="center">
      <v-col cols="12" lg="8" md="10" sm="10">
        <p>
          «Карта жизни» - это публичный геоинформационный портал (далее – Портал), созданный с целью смягчить
          отрицательное воздействие пандемии и карантинных ограничений. Любой желающий может разместить на Портале
          информацию о том, что ему нужна помощь. В то же время все те, кто готов помочь, например, волонтеры смогут
          разместить объявление и указать свое местоположение. Объявления, подаваемые на Портал проходят
          предварительную модерацию.
        </p>
        <p>
          Администрация портала предоставляет Вам доступ к использованию портала «Карта жизни» и его функционалу на
          условиях, являющихся предметом настоящих Правил. В этой связи Вам необходимо внимательно ознакомиться с
          условиями настоящих Правил, которые рассматриваются Администрацией Портала как публичная оферта в
          соответствии законодательством Республики Узбекистан (далее – законодательство).
        </p>
      </v-col>
      <v-col cols="12" md="8" sm="12">
        <div :class="(isSmallScreen ? 'text-h6' : 'text-h5') + ' font-weight-bold pb-2-'" style="color: #2e74b5">
          1.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Общие положения
        </div>
        <ul class="my-2 mx-6">
          <li class="mb-2">
            Настоящие Правила пользования порталом &laquo;Карта жизни&raquo; (далее &ndash; Правила) определяют
            условия
            использования и развития Портала, а также права и обязанности его Пользователей и Администрации. Правила
            распространяются также на отношения, связанные с правами и интересами третьих лиц, не являющимися
            Пользователями
            Портала, но чьи права и интересы могут быть затронуты в результате действий Пользователей Портала.
          </li>
          <li class="mb-2">
            Пользователь обязан полностью ознакомиться с настоящими Правилами до момента регистрации на Портале.
            Регистрация Пользователя на Портале означает полное и безоговорочное принятие Пользователем настоящих Правил
            в
            соответствии законодательством.
          </li>
          <li class="mb-2">
            Настоящие Правила могут быть изменены и/или дополнены Администрацией Портала в одностороннем порядке без
            какого-либо специального уведомления. Действующая редакция Правил располагается в сети Интернет по адресу:
            <a href="https://lifemap.uz/#/terms" target="_blank">https://lifemap.uz/terms</a>. Администрация Портала
            рекомендует
            Пользователям регулярно проверять условия настоящих Правил на предмет их изменения и/или дополнения.
            Продолжение
            использования Пользователем Портала после внесения изменений и/или дополнений в настоящие Правила означает
            принятие и согласие Пользователя с такими изменениями и/или дополнениями.
          </li>
          <li class="mb-2">
            Обращения, предложения и претензии к Администрации Портала в связи с настоящими Правилами и всеми
            вопросами
            его функционирования, могут быть направлены на <a href="https://telegram.org/" target="_blank">Телеграм</a>
            адрес <a href="https://t.me/lifemapuz/" target="_blank">@lifemapuz</a>.
          </li>
          <!--<li>
            conditions for the use and development of the Portal, as well as the rights and obligations of its Users and
            the Administration. The rules also apply to relations related to the rights and interests of third parties
            who are not the Users of the Portal, but whose rights and interests may be affected as a result of the
            actions of the Users of the Portal.
            <ul class="my-2 mx-6">
              <li v-for="n in 7" :key="n" class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-check mx-2"></i>
                <span>
                   These Terms of Use for the Portal "Life Map" (hereinafter referred to as the Rules) determine the
                 conditions for the use and development of the Portal, as well as the rights and obligations of its Users and
                 the Administration. The rules also apply to relations related to the rights and interests of third parties
                 who are not the Users of the Portal, but whose rights and interests may be affected as a result of the
                 actions of the Users of the Portal.
                 </span>

              </li>
            </ul>
          </li>-->
        </ul>
      </v-col>
      <v-col cols="12" lg="8" md="10" sm="10">
        <div :class="(isSmallScreen ? 'text-h6' : 'text-h5') + ' font-weight-bold pb-2-'" style="color: #2e74b5">
          2.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Регистрация на Портале и статус
          Пользователя
        </div>
        <ul class="my-2 mx-6">
          <li class="mb-2">
            Регистрация Пользователя на Портале является бесплатной, добровольной и производится посредством <a
                  href="https://telegram.org/" target="_blank">программы
            Телеграм</a>. Регистрация и/или авторизация на Портале посредством программы Телеграм, означает согласие с
            Правилами.
          </li>
          <li class="mb-2">
            Пользователем Портала является физическое лицо, зарегистрированное на Портале в соответствии с
            установленным
            настоящими Правилами порядком, достигшее возраста, допустимого в соответствии с законодательством для
            акцепта
            настоящих Правил, и обладающее соответствующими полномочиями (далее &ndash; Пользователь).
          </li>
          <li class="mb-2">
            При регистрации на Портале Пользователь обязан предоставить Администрации Портала необходимую достоверную
            и
            актуальную информацию. Пользователь несет ответственность за достоверность, актуальность, полноту и
            соответствие
            законодательству предоставленной при регистрации информации и ее чистоту от претензий третьих лиц.
          </li>
          <li class="mb-2">
            При регистрации Пользователь: соглашается с настоящими Правилами и принимает на себя указанные в них права
            и обязанности, связанные с использованием и функционированием Портала; предоставляет Администрации Портала
            согласие на обработку его персональных данных в целях исполнения настоящих Правил, в соответствии с
            положениями законодательства о персональных данных. После успешной регистрации Пользователя на Портале
            Администрация принимает на себя права и обязанности перед Пользователем, указанные в настоящих Правилах.
          </li>
          <li class="mb-2">
            Обработка персональных данных Пользователя осуществляется в соответствии с законодательством.
            Администрация Портала обрабатывает персональные данные Пользователя в целях предоставления Пользователю
            доступа к использованию функционала Портала, в том числе в целях получения Пользователем таргетированной
            рекламы; проверки, исследования и анализа таких данных, позволяющих поддерживать и улучшать функционал и
            разделы Портала, а также разрабатывать новый функционал и разделы Портала. Администрация Портала принимает
            все необходимые меры для защиты персональных данных Пользователя от неправомерного доступа, изменения,
            раскрытия или уничтожения. Администрация предоставляет доступ к персональным данным Пользователя только тем
            работникам, подрядчикам и агентам Администрации, которым эта информация необходима для обеспечения
            функционирования Портала и предоставления Пользователю доступа к его использованию. Администрация Портала
            вправе использовать предоставленную Пользователем информацию, в том числе персональные данные, а также
            передавать ее третьим лицам, в целях обеспечения соблюдения требований действующего законодательства, защиты
            прав и интересов Пользователей, Администрации Портала, третьих лиц (в том числе в целях выявления,
            проверки/расследования и/или пресечения противоправных действий). Раскрытие предоставленной Пользователем
            информации может быть произведено лишь в соответствии с действующим законодательством по требованию суда,
            правоохранительных органов, а равно в иных предусмотренных законодательством случаях.
          </li>
          <li class="mb-2">
            Пользователь соглашается на получение посредством сервисов Портала и/или сервисов третьих лиц электронных
            сообщений, sms и иных видов рассылок информационного, в т.ч. рекламно-информационного, содержания, в том
            числе
            от партнеров Портала.
          </li>
          <li class="mb-2">
            Пользователь не имеет права передавать свои регистрационные данные третьим лицам, несет полную
            ответственность
            за их сохранность, самостоятельно выбирая способ их хранения. Пользователь на используемом им
            аппаратно-программном обеспечении может разрешить хранение логина и пароля (с использованием файлов cookies)
            для
            последующей автоматической авторизации на Портале.
          </li>
          <li class="mb-2">
            Если Пользователем не доказано обратное, любые действия, совершенные с использованием его регистрационных
            данных, считаются совершенными соответствующим Пользователем. В случае несанкционированного доступа к
            Порталу
            под регистрационными данными Пользователя, он обязан незамедлительно сообщить об этом Администрации Портала.
          </li>
          <li class="mb-2">
            Пользователь несет полную ответственность за свои действия, связанные с созданием и размещением информации
            на Портале, в соответствии с действующим законодательством, международными правовыми актами и настоящими
            Правилами.
          </li>
          <li class="mb-2">
            В случае обнаружения факта нарушения законных прав и интересов третьих лиц, действующего законодательства,
            а также положений настоящих Правил Администрация Портала вправе по своему выбору принимать следующие меры
            как по отдельности, так и при необходимости совместно в соответствие с политикой Администрации Портала и в
            зависимости от характера и частоты соответствующих нарушений в Сообществе:
            <ul class="my-2 mx-6">
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  удалять Контент и иную информацию, размещенную на Портале Пользователем и/или блокировать доступ к ней;
                 </span>
              </li>
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  блокировать доступ конкретных пользователей к Порталу;
                 </span>
              </li>
            </ul>
          </li>
        </ul>
      </v-col>
      <v-col cols="12" md="8" sm="12">
        <div :class="(isSmallScreen ? 'text-h6' : 'text-h5') + ' font-weight-bold pb-2-'" style="color: #2e74b5">
          3.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Обязанности Пользователя
        </div>
        <ul class="my-2 mx-6">
          <li class="mb-2">
            При использовании Портала Пользователь обязан:
            <ul class="my-2 mx-6">
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  соблюдать положения действующего законодательства, международные правовые акты и настоящие
                  Правила;
                 </span>
              </li>
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  предоставлять при регистрации достоверные, полные и актуальные данные, следить за их
                  актуализацией;
                 </span>
              </li>
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  информировать Администрацию Портала о несанкционированном доступе к Порталу под регистрационными
                  данными Пользователя;
                 </span>
              </li>
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  не предоставлять доступ другим Пользователям к порталу под собственными регистрационными данными,
                  если это
                  может привести к нарушению законодательства и/или настоящих Правил;
                </span>
              </li>
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  не размещать на Портале информацию и объекты (включая ссылки на них), которые могут нарушать        права и        интересы        других лиц;
                </span>
              </li>
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  перед размещением информации и объектов (включая, но не ограничиваясь, изображениями других лиц,
                  чужими
                  текстами различного содержания, аудиозаписями и видеофильмами) предварительно оценивать законность их
                  размещения;
                </span>
              </li>
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  хранить в тайне и не предоставлять другим Пользователям и третьим лицам ставшие ему известными в
                  результате
                  общения с другими Пользователями и иного использования Портала персональные данные (включая, но не
                  ограничиваясь, домашними адресами, номерами телефонов, адресами электронной почты, паспортными данными,
                  банковской информацией) и информацию о частной жизни других Пользователей и третьих лиц без получения
                  соответствующего предварительного разрешения последних;
                </span>
              </li>
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  осуществлять резервное копирование важной для Пользователя информации.
                </span>
              </li>
            </ul>
          </li>
          <li class="mb-2">
            В случае наличия сомнений в отношении законности осуществления тех или иных действий, в том числе по
            размещению информации или предоставлению доступа, Администрация Портала рекомендует воздержаться от
            осуществления последних.
          </li>
          <li class="mb-2">
            Пользователю при использовании Портала запрещается:
            <ul class="my-2 mx-6">
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  регистрироваться в качестве Пользователя от имени или вместо другого лица («фальшивый аккаунт») или
                  регистрировать группу (объединение) лиц или юридическое лицо в качестве Пользователя. При этом,
                  возможна регистрация от имени и поручению другого физического лица или юридического лица при
                  условии получения необходимых полномочий в порядке и форме, предусмотренных законодательством;
                </span>
              </li>
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  вводить Пользователей в заблуждение относительно своей личности, используя регистрационные данные
                  другого зарегистрированного Пользователя;
                </span>
              </li>
              <li class="mt-2" style="list-style-type: none; display: flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  искажать сведения о себе, своем возрасте или своих отношениях с другими лицами или организациями;
                </span>
              </li>
              <li class="mt-2" style="list-style-type: none; display: inline-flex">
                <i class="mdi mdi-minus mx-2"></i>
                <span>
                  загружать, хранить, публиковать, распространять и предоставлять доступ или иным образом использовать
                  любую информацию, которая:
                 </span>

              </li>
              <ul class="my-2 mx-6">
                <li class="mt-2" style="list-style-type: none; display: flex">
                  <i class="mdi mdi-check mx-2"></i>
                  <span>
                      содержит угрозы, дискредитирует, оскорбляет, порочит честь и достоинство или деловую
                      репутацию или нарушает неприкосновенность частной жизни других Пользователей или третьих лиц;
                    </span>
                </li>
                <li class="mt-2" style="list-style-type: none; display: flex">
                  <i class="mdi mdi-check mx-2"></i>
                  <span>
                      нарушает права несовершеннолетних лиц;
                    </span>
                </li>
                <li class="mt-2" style="list-style-type: none; display: flex">
                  <i class="mdi mdi-check mx-2"></i>
                  <span>
                      является вульгарной или непристойной, содержит порнографические изображения и тексты или сцены сексуального характера с участием несовершеннолетних;
                    </span>
                </li>
                <li class="mt-2" style="list-style-type: none; display: flex">
                  <i class="mdi mdi-check mx-2"></i>
                  <span>
                      содержит сцены бесчеловечного обращения с животными;
                    </span>
                </li>
                <li class="mt-2" style="list-style-type: none; display: flex">
                  <i class="mdi mdi-check mx-2"></i>
                  <span>
                      содержит описание средств и способов суицида, любое подстрекательство к его совершению;
                    </span>
                </li>
                <li class="mt-2" style="list-style-type: none; display: flex">
                  <i class="mdi mdi-check mx-2"></i>
                  <span>
                      пропагандирует и/или способствует разжиганию расовой, религиозной, этнической ненависти или вражды, пропагандирует фашизм или идеологию расового превосходства;
                    </span>
                </li>
                <li class="mt-2" style="list-style-type: none; display: flex">
                  <i class="mdi mdi-check mx-2"></i>
                  <span>
                      содержит экстремистские материалы;
                    </span>
                </li>
                <li class="mt-2" style="list-style-type: none; display: flex">
                  <i class="mdi mdi-check mx-2"></i>
                  <span>
                      пропагандирует преступную деятельность или содержит советы, инструкции или руководства по
        совершению
        преступных действий;
                    </span>
                </li>
                <li class="mt-2" style="list-style-type: none; display: flex">
                  <i class="mdi mdi-check mx-2"></i>
                  <span>
содержит информацию ограниченного доступа, включая, но не ограничиваясь, государственной и
        коммерческой
        тайной, информацией о частной жизни третьих лиц;
                    </span>
                </li>
                <li class="mt-2" style="list-style-type: none; display: flex">
                  <i class="mdi mdi-check mx-2"></i>
                  <span>
содержит рекламу или описывает привлекательность употребления наркотических веществ, в том числе
        &laquo;цифровых
        наркотиков&raquo; (звуковых файлов, оказывающих воздействие на мозг человека за счет бинауральных ритмов),
        информацию о распространении наркотиков, рецепты их изготовления и советы по употреблению;
                    </span>
                </li>
                <li class="mt-2" style="list-style-type: none; display: flex">
                  <i class="mdi mdi-check mx-2"></i>
                  <span>
потенциально может привести к совершению противоправных действий путем введения Пользователей в
        заблуждение
        или злоупотребления их доверием;
                    </span>
                </li>
                <li class="mt-2" style="list-style-type: none; display: flex">
                  <i class="mdi mdi-check mx-2"></i>
                  <span>
а также нарушает иные права и интересы граждан и юридических лиц или требования
        законодательства.
                    </span>
                </li>
              </ul>
              <li class="mt-2" style="list-style-type: none; display: inline-flex">
                <i class="mdi mdi-minus mx-2"></i>незаконно загружать, хранить, публиковать, распространять и
                предоставлять доступ или иным образом
                использовать
                интеллектуальную собственность Пользователей и третьих лиц;
              </li>
              <li class="mt-2" style="list-style-type: none; display: inline-flex">
                <i class="mdi mdi-minus mx-2"></i>осуществлять массовые рассылки сообщений в адрес других Пользователей
                Портала без их согласия;
              </li>
              <li class="mt-2" style="list-style-type: none; display: inline-flex">
                <i class="mdi mdi-minus mx-2"></i>использовать программное обеспечение и осуществлять действия,
                направленные на нарушение
                нормального
                функционирования Портала или персональных страниц Пользователей;
              </li>
              <li class="mt-2" style="list-style-type: none; display: inline-flex">
                <i class="mdi mdi-minus mx-2"></i>агружать, хранить, публиковать, распространять и предоставлять доступ
                или иным образом
                использовать
                вирусы,
                трояны и другие вредоносные программы;
              </li>
              <li class="mt-2" style="list-style-type: none; display: inline-flex">
                <i class="mdi mdi-minus mx-2"></i>использовать без специального на то разрешения Администрации Портала
                автоматизированные скрипты
                (программы,
                боты, краулеры) для сбора информации на Портале и/или взаимодействия с Порталом и его функционалом;
              </li>
              <li class="mt-2" style="list-style-type: none; display: inline-flex">
                <i class="mdi mdi-minus mx-2"></i>любым способом, в том числе, но не ограничиваясь, путем обмана,
                злоупотребления доверием, взлома,
                пытаться
                получить доступ к регистрационным данным другого Пользователя;
              </li>
              <li class="mt-2" style="list-style-type: none; display: inline-flex">
                <i class="mdi mdi-minus mx-2"></i>осуществлять незаконные сбор и обработку персональных данных других
                лиц;
              </li>
              <li class="mt-2" style="list-style-type: none; display: inline-flex">
                <i class="mdi mdi-minus mx-2"></i>осуществлять использование Портала иным способом, кроме как через
                интерфейс, предоставленный
                Администрацией
                Портала, за исключением случаев, когда такие действия были прямо разрешены Пользователю в соответствии с
                отдельным соглашением с Администрацией;
              </li>
              <li class="mt-2" style="list-style-type: none; display: inline-flex">
                <i class="mdi mdi-minus mx-2"></i>воспроизводить, дублировать, копировать, продавать, осуществлять
                торговые операции и
                перепродавать доступ
                к
                использованию Портала, в том числе его неактивированных данных и команд, для каких-либо целей, за
                исключением
                случаев, когда такие действия были прямо разрешены Пользователю в соответствии с условиями настоящих
                Правил
                или
                отдельного соглашения с Администрацией;
              </li>
              <li class="mt-2" style="list-style-type: none; display: inline-flex">
                <i class="mdi mdi-minus mx-2"></i>размещать коммерческую и политическую рекламу;
              </li>
              <li class="mt-2" style="list-style-type: none; display: inline-flex">
                <i class="mdi mdi-minus mx-2"></i>размещать любую другую информацию, которая, по личному мнению
                Администрации, является
                нежелательной, не
                соответствует целям создания Портала, ущемляет интересы Пользователей или по другим причинам является
                нежелательной для размещения на Портале;
              </li>
            </ul>
          </li>
          <li class="mb-2">Пользователь несет личную ответственность за любую информацию, которую размещает на Портале,
            сообщает
            другим
            Пользователям, а также за любые взаимодействия с другими Пользователями, осуществляемые на свой риск.
          </li>
          <li class="mb-2">В случае несогласия Пользователя с настоящими Правилами или их обновлениями, Пользователь
            обязан
            отказаться от
            использования Портала, проинформировав об этом Администрацию Портала в установленном порядке.
          </li>
        </ul>
      </v-col>
      <v-col cols="12" md="8" sm="12">
        <div :class="(isSmallScreen ? 'text-h6' : 'text-h5') + ' font-weight-bold pb-2-'" style="color: #2e74b5">
          4.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Интеллектуальные права
        </div>
        <ul class="my-2 mx-6">
          <li class="mb-2">Все объекты, размещенные на Портале, в том числе элементы дизайна, текст, графические
            изображения,
            иллюстрации, видео, скрипты, программы, музыка, звуки и другие объекты и их подборки (далее &mdash;
            Контент),
            являются объектами исключительных прав Администрации, Пользователей Портала и других правообладателей, все
            права
            на эти объекты защищены.
          </li>
          <li class="mb-2">Кроме случаев, установленных настоящими Правилами, а также действующим законодательством,
            никакой
            Контент
            не
            может быть скопирован (воспроизведен), переработан, распространен, отображен во фрейме, опубликован, скачан,
            передан, продан или иным способом использован целиком или по частям без предварительного разрешения
            правообладателя, кроме случаев, когда правообладатель явным образом выразил свое согласие на свободное
            использование Контента любым лицом. Воспроизведение, копирование, сбор, систематизация, хранение, передача
            Контента с целью создания базы данных в коммерческих и/или некоммерческих целях и/или использование Контента
            полностью или в любой его части, независимо от способа использования, без согласия Администрации не
            допускается.
          </li>
          <li class="mb-2">Пользователь, размещая на Портале принадлежащий ему на законных основаниях Контент,
            предоставляет
            другим
            пользователям неисключительное право на его использование исключительно в рамках предоставляемого Порталом
            функционала, путем просмотра, воспроизведения (в том числе копирования) и иные права исключительно с целью
            личного некоммерческого использования, кроме случаев, когда такое использование причиняет или может
            причинить
            вред охраняемым законом интересам правообладателя.
          </li>
          <li class="mb-2">Использование Пользователем Контента, доступ к которому получен исключительно для личного
            некоммерческого
            использования, допускается при условии сохранения всех знаков авторства (копирайтов) или других уведомлений
            об
            авторстве, сохранения имени автора в неизменном виде, сохранении произведения в неизменном виде.
          </li>
          <li class="mb-2">Пользователь предоставляет также Администрации Портала неисключительное право использовать на
            безвозмездной
            основе размещенный на Портале и принадлежащий ему на законных основаниях Контент в целях обеспечения
            Администрацией Портала функционирования Портала в объеме, определяемом функционалом и архитектурой Портала,
            и
            отображения Контента в промоматериалах Администрации Портала, в том числе в рамках изображений интерфейса
            Портала, в том числе путём доведения таких промоматериалов до всеобщего сведения. Указанное неисключительное
            право предоставляется на срок размещения Контента на Портале и распространяет свое действие на территории
            стран
            всего мира. Окончание срока размещения Контента на Портале и/или срока действия неисключительного права не
            влечет за собой необходимость изъятия из оборота промоматериалов Администрации Портала с отображением
            Контента
            (в том числе их удаление из сети Интернет). Администрация Портала вправе передавать права, указанные в
            настоящем
            пункте третьим лицам. Пользователь соглашается с тем, что Администрация вправе использовать функциональные и
            технические возможности Портала, обеспечивающие отображение размещаемого Пользователем Контента,
            предназначенные
            для целей отображения Контента, по своему усмотрению, в том числе для целей показа рекламной информации.
          </li>
          <li class="mb-2">Если Пользователь удаляет свой Контент с Портала, неисключительное право, упомянутое выше
            будет
            автоматически
            отозвано, однако Администрация оставляет за собой право в случае необходимости, обусловленной техническими
            особенностями работы Портала, сохранять архивные копии пользовательского Контента в течение необходимого
            срока.
          </li>
          <li class="mb-2">Кроме своего собственного Контента, Пользователь не вправе загружать или иным образом
            доводить до
            всеобщего
            сведения (публиковать на Портале) Контент других Порталов, баз данных и прочие результаты интеллектуальной
            деятельности при отсутствии явным образом выраженного согласия правообладателя на такие действия.
          </li>
          <li class="mb-2">Любое использование Портала или Контента, кроме разрешенного в настоящих Правилах или в
            случае
            явно
            выраженного согласия правообладателя на такое использование, без предварительного письменного разрешения
            правообладателя, категорически запрещено.
          </li>
          <li class="mb-2">Если иное явным образом не установлено в настоящих Правилах, ничто в настоящих Правилах не
            может
            быть
            рассмотрено как передача исключительных прав на Контент.
          </li>
        </ul>
      </v-col>
      <v-col cols="12" md="8" sm="12">
        <div :class="(isSmallScreen ? 'text-h6' : 'text-h5') + ' font-weight-bold pb-2-'" style="color: #2e74b5">
          5.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Контент Портала
        </div>
        <ul class="my-2 mx-6">
          <li class="mb-2">Пользователь несет личную ответственность за любой Контент или иную информацию, которые он
            загружает или
            иным
            образом доводит до всеобщего сведения (публикует) на Портале или с его помощью. Пользователь не имеет права
            загружать, передавать или публиковать Контент на Портале, если он не обладает соответствующими правами на
            совершение таких действий, приобретенными или переданными ему в соответствии с законодательством.
          </li>
          <li class="mb-2">Администрация Портала может, но не обязана, просматривать Портал на наличие запрещенного
            Контента
            и может
            удалять или перемещать (без предупреждения) любой Контент или пользователей по своему личному усмотрению, по
            любой причине или без причины, включая без всяких ограничений перемещение или удаление Контента, который, по
            личному мнению Администрации, нарушает настоящие Правила, законодательство и/или может нарушать права,
            причинить
            вред или угрожать безопасности других Пользователей или третьих лиц.
          </li>
          <li class="mb-2">Портал может содержать ссылки на другие Порталы в сети Интернет (Порталы третьих лиц) так же,
            как
            и
            статьи,
            фотографии, иллюстрации, графические изображения, музыку, звуки, видео, информацию, приложения, программы и
            другой Контент, принадлежащий или исходящий от третьих лиц (Контент третьих лиц), являющийся результатом
            интеллектуальной деятельности и охраняемых в соответствии с законодательством.
          </li>
          <li class="mb-2">Указанные третьи лица и их Контент не проверяются Администрацией на соответствие тем или иным
            требованиям
            (достоверности, полноты, добросовестности и т.п.). Администрация не несет ответственность за любую
            информацию,
            размещенную на Порталах третьих лиц, к которым Пользователь получает доступ через Портал или через Контент
            третьих лиц, включая, в том числе, любые мнения или утверждения, выраженные на Порталах третьих лиц или в их
            Контенте.
          </li>
          <li class="mb-2">Размещенные на Портале ссылки или руководства по скачиванию файлов и/или установке программ
            третьих лиц не
            означают поддержки или одобрения этих действий со стороны Администрации.
          </li>
          <li class="mb-2">Ссылка на любой Портал, продукт, услугу, любую информацию коммерческого или некоммерческого
            характера,
            размещенная на Портале, не является одобрением или рекомендацией данных продуктов (услуг) со стороны
            Администрации.
          </li>
          <li class="mb-2">Если Пользователь решил покинуть Портал и перейти к Порталам третьих лиц или использовать,
            или
            установить
            программы третьих лиц, он делает это на свой риск и с этого момента настоящие Правила более не
            распространяются
            на Пользователя. При дальнейших действиях Пользователю стоит руководствоваться применимыми нормами и
            политикой,
            в том числе деловыми обычаями тех лиц, чей Контент он собирается использовать.
          </li>
        </ul>
      </v-col>

      <v-col cols="12" md="8" sm="12">
        <div :class="(isSmallScreen ? 'text-h6' : 'text-h5') + ' font-weight-bold pb-2-'" style="color: #2e74b5">
          6.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Функционирование Портала и
          ответственность при его использовании
        </div>
        <ul class="my-2 mx-6">
          <li class="mb-2">Пользователи несут ответственность за собственные действия в связи с созданием и размещением
            информации на
            Портале в соответствии с действующим законодательством. Нарушение настоящих Правил и действующего
            законодательства влечет за собой гражданско-правовую, административную и уголовную ответственность.
          </li>
          <li class="mb-2">Администрация Портала предоставляет техническую возможность его использования Пользователями,
            не
            участвует
            в
            формировании содержания Контента Пользователей и не контролирует, и не несет ответственности за действия или
            бездействие любых лиц в отношении использования Портала.
          </li>
          <li class="mb-2">В информационной системе Портала и его программном обеспечении отсутствуют технические
            решения,
            осуществляющие
            автоматические цензуру и контроль действий и информационных отношений Пользователей по использованию
            Портала, за
            исключением специальных технических решений, которые могут реализовываться Администрацией в целях
            предотвращения
            и пресечения нарушений прав третьих лиц на результаты интеллектуальной деятельности.
          </li>
          <li class="mb-2">Администрация сохраняет за собой право в любое время изменять оформление Портала, его
            содержание,
            функционал,
            изменять или дополнять используемые скрипты, программное обеспечение и другие объекты, используемые или
            хранящиеся на Портале, любые серверные приложения в любое время с предварительным уведомлением или без
            такового.
          </li>
          <li class="mb-2">Администрация Портала производит предварительную модерацию информации Пользователей и
            предпринимает любые
            иные
            действия по защите прав и интересов лиц и обеспечению соблюдения требований законодательства.
          </li>
          <li class="mb-2">Администрация Портала не несет ответственности за нарушение Пользователем настоящих Правил и
            оставляет за
            собой право по своему собственному усмотрению, а также при получении информации от других пользователей либо
            третьих лиц о нарушении Пользователем настоящих Правил, изменять (модерировать), блокировать или удалять
            любую
            публикуемую Пользователем информацию, нарушающую запреты, установленные настоящими Правилами,
            приостанавливать,
            ограничивать или прекращать доступ Пользователя ко всем или к любому из разделов или функционалу Портала, в
            любое время по любой причине или без объяснения причин, с предварительным уведомлением или без такового.
            Администрация Портала закрепляет за собой право приостановить, ограничить или прекратить доступ Пользователя
            к
            любой из функциональных возможностей Портала, если Администрация обнаружит, что по ее мнению, Пользователь
            представляет угрозу для Портала и/или его Пользователей.
          </li>
          <li class="mb-2">Наряду с указанным в настоящем пункте выше Администрация Портала вправе блокировать и/или
            удалять
            Приложения
            API, ограничивать доступ Пользователей к Приложения API, Порталам, приложениям третьих лиц, иным сторонним
            ресурсам, блокировать и/или удалять ссылки на них, в случае если у Администрации Портала появятся основания
            полагать, что такие Приложения API, Порталы, приложения третьих лиц, иные сторонние ресурсы представляют или
            могут представлять угрозу для нормальной работы Портала и его Пользователей. Администрация Портала реализует
            описанные выше меры в соответствии с применимым законодательством и не несет ответственности за возможные
            негативные последствия таких мер для Пользователя или третьих лиц.
          </li>
          <li class="mb-2">Администрация Портала обеспечивает функционирование и работоспособность Портала и обязуется
            оперативно
            восстанавливать его работоспособность в случае технических сбоев и перерывов. Администрация Портала не несет
            ответственности за временные сбои и перерывы в работе Портала и вызванные ими потерю информации.
            Администрация
            не несет ответственности за любой ущерб компьютеру Пользователя или иного лица, мобильным устройствам,
            любому
            другому оборудованию или программному обеспечению, вызванный или связанный со скачиванием материалов с
            Портала
            или по ссылкам, размещенным на Портале.
          </li>
          <li class="mb-2">Администрация Портала имеет право распоряжаться статистической информацией, связанной с
            функционированием
            Портала, а также информацией Пользователей для обеспечения адресного показа рекламной информации различным
            аудиториям Пользователей Портала.
          </li>
          <li class="mb-2">Администрация Портала имеет право направлять Пользователю информацию о развитии Портала и его
            функционала,
            а
            также рекламировать собственную деятельность.
          </li>
        </ul>
      </v-col>

      <v-col cols="12" md="8" sm="12">
        <div :class="(isSmallScreen ? 'text-h6' : 'text-h5') + ' font-weight-bold pb-2-'" style="color: #2e74b5">
          7.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Ограничение ответственности Администрации
          Портала:
        </div>
        <ul class="my-2 mx-6">
          <li class="mb-2">Портал и его функционал, включая все скрипты, приложения, контент и оформление портала
            поставляются
            &laquo;как
            есть&raquo;. Администрация отказывается от всяких гарантий того, что Портал или его функционал могут
            подходить
            или не подходить для конкретных целей использования. Администрация не может гарантировать и не обещает
            никаких
            специфических результатов от использования портала и/или его функционала.
          </li>
          <li class="mb-2">Во избежание недоразумений пользователю следует соблюдать меры предосторожности в скачивании
            с
            портала или
            по
            размещенным на нем ссылкам, и использовании любых файлов, в том числе программного обеспечения.
            Администрация
            портала настоятельно рекомендует использовать только лицензионное, в том числе антивирусное, программное
            обеспечение.
          </li>
          <li class="mb-2">Используя портал, пользователь соглашается с тем, что скачивает с портала или с его помощью
            любые
            материалы на
            свой собственный риск и несет личную ответственность за возможные последствия использования указанных
            материалов, в том числе за ущерб, который это может причинить компьютеру пользователя или третьим лицам, за
            потерю данных или любой другой вред.
          </li>
          <li class="mb-2">Ни при каких обстоятельствах администрация портала или ее представители не несут
            ответственность
            перед
            пользователем или перед любыми третьими лицами за любой косвенный, случайный, неумышленный ущерб, включая
            упущенную выгоду или потерянные данные, вред чести, достоинству или деловой репутации, вызванный в связи с
            использованием портала, содержимого портала или иных материалов, к которым вы или иные лица получили доступ
            с
            помощью портала, даже если администрация портала предупреждала или указывала на возможность такого вреда.
          </li>
        </ul>
      </v-col>

      <v-col cols="12" md="8" sm="12">
        <div :class="(isSmallScreen ? 'text-h6' : 'text-h5') + ' font-weight-bold pb-2-'" style="color: #2e74b5">
          8.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; Заключительные положения
        </div>
        <ul class="my-2 mx-6">
          <li class="mb-2">Настоящие Правила составляют соглашение между Пользователем и Администрацией Портала
            относительно
            порядка
            использования Портала и его функционала и заменяют собой все предыдущие соглашения между Пользователем и
            Администрацией.
          </li>
          <li class="mb-2">Настоящие Правила регулируются и толкуются в соответствии с законодательством. Вопросы, не
            урегулированные
            Правилами, подлежат разрешению в соответствии с законодательством.
          </li>
          <li class="mb-2">В случае возникновения любых споров или разногласий, связанных с исполнением настоящих
            Правил,
            Пользователь и
            Администрация Портала приложат все усилия для их разрешения путем проведения переговоров между ними. В
            случае,
            если споры не будут разрешены путем переговоров, споры подлежат разрешению в порядке, установленном
            действующим
            законодательством.
          </li>
          <li class="mb-2">Настоящие Правила вступают в силу для Пользователя с момента его присоединения к ним и
            действуют
            в течение
            неопределенного срока.
          </li>
          <li class="mb-2">Настоящие Правила составлены на русском языке и могут быть предоставлены Пользователю для
            ознакомления на
            другом языке. В случае расхождения русскоязычной версии Правил и версии Правил на ином языке, применяются
            положения русскоязычной версии настоящих Правил.
          </li>
          <li class="mb-2">Если по тем или иным причинам одно или несколько положений настоящих Правил будут признаны
            недействительными
            или не имеющими юридической силы, это не оказывает влияния на действительность или применимость остальных
            положений.
          </li>
        </ul>
      </v-col>
    </v-row>
  </v-container>


</template>

<script>
    export default {
        name: "TemplateRu",
        data: function () {
            return {
                model: null,
                windowSize: {
                    x: 0,
                    y: 0,
                }
            }
        },
        mounted() {
            this.onResize()
        },
        methods: {
            onResize() {
                // console.log('on resize')
                this.windowSize = {x: window.innerWidth, y: window.innerHeight}
            },
        },
        computed: {
            isXSmallScreen() {
                return this.windowSize.x < 700
            },
            isSmallScreen() {
                return this.windowSize.x < 960
            },
        }
    }
</script>

<style scoped>

</style>
